public class Main {
    public static void main(String[] args) {
        int coast = 100;
        int storage = 20;
        int bonus;
        System.out.println("За вашу покупку начилиться: " + (bonus = coast/storage) + " бонусов");


        // Объявляете переменные для входных данных и
        // параметров программы: одну для хранения
        // стоимости билета, другую для хранения количества
        // рублей для одной бонусной мили

        // Рассчитываете количество бонусных миль, используя
        // значения заведённых переменных. Ответ сохраняете в
        // новую переменную и выводите на экран
    }
}